Revit 2027 API
InitialWattageIntensity.Efficacy Property
 The efficacy value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Efficacy { get; set; }
Public Property Efficacy As Double
	Get
	Set
public:
property double Efficacy {
	double get ();
	void set (double value);
}
member Efficacy : float with get, set
Property Value
Double
 The efficacy value in lm/W as a numerical value greater than 0.0 and less than 1.0e+10.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The efficacy value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace